In [1]:
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', 10)

In [8]:
exam_data  = {'nom': ['Anne', 'Alex', 'catherine', 'Jean', 'Emillie', 'Michel', 'Matieu', 'Laura', 'Kevin', 'Jonas'],
        'note': [12.5, 20, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
               'moyenne': [15, 18, 16.5, 9.1, 11.25, 17.5, 11.0, 13.8, 7.6, 14.3],
        'qualification': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)
df

         nom  note  moyenne qualification
a       Anne  12.5    15.00           yes
b       Alex  20.0    18.00            no
c  catherine  16.5    16.50           yes
d       Jean   NaN     9.10            no
e    Emillie   9.0    11.25            no
f     Michel  20.0    17.50           yes
g     Matieu  14.5    11.00           yes
h      Laura   NaN    13.80            no
i      Kevin   8.0     7.60            no
j      Jonas  19.0    14.30           yes

In [4]:
df.nlargest(3,'note')

      nom  note qualification
b    Alex  20.0            no
f  Michel  20.0           yes
j   Jonas  19.0           yes

In [5]:
# gestion de l'index
df.nlargest(3,'note', keep='last')

      nom  note qualification
f  Michel  20.0           yes
b    Alex  20.0            no
j   Jonas  19.0           yes

In [12]:
# Classement sur plusieurs colonnes
df.nlargest(3,['note','moyenne'])

      nom  note  moyenne qualification
b    Alex  20.0     18.0            no
f  Michel  20.0     17.5           yes
j   Jonas  19.0     14.3           yes

In [6]:
df.nlargest(3,'nom')

TypeError: Column 'nom' has dtype object, cannot use method 'nlargest' with this dtype

In [7]:
df.nsmallest(3,'note')

       nom  note qualification
i    Kevin   8.0            no
e  Emillie   9.0            no
a     Anne  12.5           yes